Number of training images of each class:

* normal: 1600
* nebulosity: 1420
* nebulosity_light: 846
* sky_error: 503

Number of validation images of each class:

* normal: 400
* nebulosity: 355
* nebulosity_light: 212
* sky_error: 126

Number of parameters: 75352

Layers:

          InputLayer (None, 512, 512, 1)   
              Conv2D (None, 512, 512, 12)  
        MaxPooling2D (None, 256, 256, 12)  
              Conv2D (None, 256, 256, 24)  
        MaxPooling2D (None, 128, 128, 24)  
              Conv2D (None, 128, 128, 24)  
              Conv2D (None, 128, 128, 24)  
              Conv2D (None, 128, 128, 24)  
        MaxPooling2D (None, 64, 64, 24)    
              Conv2D (None, 64, 64, 32)    
              Conv2D (None, 64, 64, 32)    
              Conv2D (None, 64, 64, 32)    
        MaxPooling2D (None, 32, 32, 32)    
              Conv2D (None, 32, 32, 32)    
              Conv2D (None, 32, 32, 32)    
              Conv2D (None, 32, 32, 32)    
        MaxPooling2D (None, 16, 16, 32)    
              Conv2D (None, 14, 14, 32)    
              Conv2D (None, 12, 12, 32)    
              Conv2D (None, 12, 12, 32)    
        MaxPooling2D (None, 6, 6, 32)      
GlobalAveragePooling2D (None, 32)          
              Dropout (None, 32)           
                Dense (None, 12)           
              Dropout (None, 12)           
                Dense (None, 4)

Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 512, 512, 12)      312       
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 256, 256, 12)      0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 256, 256, 24)      7224      
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 128, 128, 24)      0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 128, 128, 24)      5208      
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 128, 128, 24)      5208      
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 128, 128, 24)      600       
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 64, 64, 24)        0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 64, 64, 32)        6944      
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 64, 64, 32)        9248      
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 64, 64, 32)        1056      
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 32, 32, 32)        0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 32, 32, 32)        9248      
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 32, 32, 32)        9248      
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 32, 32, 32)        1056      
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 14, 14, 32)        9248      
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 12, 12, 32)        9248      
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 12, 12, 32)        1056      
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 6, 6, 32)          0         
_________________________________________________________________
global_average_pooling2d_1 ( (None, 32)                0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 12)                396       
_________________________________________________________________
dropout_2 (Dropout)          (None, 12)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 4)                 52        
=================================================================

